app/controllers/accounts_controller.rb

SELECT * FROM "accounts"
---
  def index
    @accounts = Account.all

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
---
  def show
    @account = Account.find(params[:id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
---
  def edit
    @account = Account.find(params[:id])

INSERT INTO "accounts" ("name", "comment", "created_at", "updated_at", "url", "login", "password") VALUES('Mail Google', '', '2010-03-13 08:04:44', '2010-03-13 08:04:44', 'gmail.com', 'openlf', 'mypwd')
---
  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
UPDATE "accounts" SET "updated_at" = '2010-03-14 11:29:31', "comment" = 'fgghfhgfgh
---
  def update
    @account = Account.find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 2)
DELETE FROM "accounts" WHERE "id" = 2
---
  def destroy
    @account = Account.find(params[:id])
    @account.destroy