app/controllers/identities_controller.rb

SELECT * FROM "identities" WHERE ("identities".user_id = 1)
---
  def index
    @identities = current_user.identities.all

SELECT * FROM "identities" WHERE ("identities"."id" = 5 AND ("identities".user_id = 1))
---
  def show
    @identity = current_user.identities.find(params[:id])

SELECT * FROM "identities" WHERE ("identities"."id" = 4 AND ("identities".user_id = 2))
---
  def edit
    @identity = current_user.identities.find(params[:id])

INSERT INTO "identities" ("name", "comment", "created_at", "updated_at", "url", "user_id", "login", "password") VALUES('GMail', 'un commentaire passionnant', '2010-04-06 20:45:37', '2010-04-06 20:45:37', 'www.gmail.com', NULL, 'test.test', 'pwd')
---
  def create
    @identity = current_user.identities.new(params[:identity])

    respond_to do |format|
      if @identity.save

SELECT * FROM "identities" WHERE ("identities"."id" = 3 AND ("identities".user_id = 2))
UPDATE "identities" SET "updated_at" = '2010-04-29 21:10:48', "name" = 'GMail12', "comment" = 'un commentaire avec des choses dedans' WHERE "id" = 3
---
  def update
    @identity = current_user.identities.find(params[:id])

    respond_to do |format|
      if @identity.update_attributes(params[:identity])

SELECT * FROM "identities" WHERE ("identities"."id" = 3 AND ("identities".user_id = 2))
DELETE FROM "identities" WHERE "id" = 3
---
  def destroy
    @identity = current_user.identities.find(params[:id])
    @identity.destroy