app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by_email(params[:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'openlf@free.fr') LIMIT 1

  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save
---
UPDATE "users" SET "persistence_token" = 'a8abcb015abb9a8001c102d5e01f157c3e7b2c8155504a50d70271fbef8a88a7e0aa4e52cab8a0b758583233687122135586c99d5527d578ac3f4a55a1d17735', "updated_at" = '2010-05-30 08:06:52', "perishable_token" = 'ql7fbUBj_RTmsRnSwqKC', "password_salt" = 'kCnJvhXmOSMkYCdZgQXk', "crypted_password" = 'f52a9ecd2d61c15d809c1fda0a32d045bea17531fd476149d8a632c6fe17c8cd33b5e96c6204fbb31c9ea33440a2d0c1f45a93e2243af174815f1bdef33b80fe' WHERE "id" = 1

  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])
---
SELECT * FROM "users" WHERE (perishable_token = 'K2T3wg_Ifv0QcL57ldJJ' and updated_at > '2010-05-30 07:27:07') LIMIT 1