app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "secretkey", "email") VALUES('2010-03-27 08:53:17', 'e461f70ba61656fb06e14ca1306ce6512116158a1e9113f2a51cb6b4027d710899623792ae5660b337adf12f86b69acce6eedd7bcf6dcd33135926d650cf58ac', '2010-03-27 08:53:17', 'test', 'l03-bq3KEJO41pz9Kq8P', '179cba10ca71d54eacdad0e65b9f1643fa50949a3f4032196c2cd197d20216ca7e5f32982d8bf07217811b2bf186c78479348b6cfc5d1a2da740b04c931d870c', '', 'openlf@free.fr')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "test_sentence" = 'azertyuiop', "updated_at" = '2010-04-12 21:28:57', "secretkey" = 'te' WHERE "id" = 1